const express = require("express");
const router = express.Router();
const { Offers } = require("../models");
var text = "取気勝加文度子覧活回玉団重受済票。話京託並感併入著歳横文党弱終言渉氏日臣。新情関居力講熊階訴行禁象大。告事供案知悪権次変消弓良町訓医会囲。世木経稿頭権何政写和包優。旗題下野身覧一終期用主割韻東政。問知念聞善康税表堀別竜芸千梨信表系竹順編。円第気禁空発報非測地能属術。著大可賄図笠氏申者康上稿賀政学盤。花陳稿長給勢空組意災村座御。希賞職刊鑑王指戦大舌八写。無政金綱授作発入由和団入登読禁今前旅。話社試掲可幕後若会掲金貸夕読固事陣述限郎。匠班際史説決分会件替原政検意写稿就馬郷。徳用熱全新土巨料辺済予財境。黄取社事題期一学掛効貨乳福憾猛国。市題出戦衛貯推済骨最属撤集変壁苦印手責。西的陸提高針応情亡政英際。稿題今表真引本属央軽況視物社的上。家細奪夏芸語左立面朝軽親区触座。測五脱委拉風最博愛話力一情再表井漂。調写退注変題気兵危十役利版暮市遺士底。得変今立害全認両題達徳多転続時陸目幅行口。泉京増必和吉社認計稿取共中読響伝去枠群雪。迎信情井暴巨問梨朝講訪兵剛。雑治覧月石媛行済恐集伝低日認定近明米好残。因宮数訓中覧棋提進要健最体属位。点能暮就始川覧切掲自児劇田数同間延義。立毎信国盗画外機排輪写達将現巻携。設成子域必予索属午稿狼例強措提氷歩万南。春回負工約下育見記天伴芸首政暗就次金盗。性命政元暮藤条寄雑荷夕禁容。竹文青様用放馬学南暮白評調前。渡護玉改状熊去読由作集書禁待舞稿。花能概読方堂投業月念膨代詳。夜競育託県事警調注権名質。既中見江格地取度客月量塁府末領真刊。聴下事熊核者殺症必賞帯鳥載。回万球氏河丁携係任更来効映載天解勢座権出。松言早提禁弘熱題由風判必雪芸。喜設必型界谷市贈子男後知台的際。延局味護使供必跳連活平連。話研民社官職索提囲写暮十寒。世康殺済暮東急積道楽断眺明合杯兵紹違。笑作県見経験域態記芸欲残。友台禁者真元自瞬生直合著語。見化的抱堂動分編属連索迎無鮮。備身洋都行緒機本旅競辞録。資崎同北書埋号美医歳屋場隆市申。残集土系表明読超情性団議的究見要催。榎悪分町康意疲由属豊境産桜水。属山従部関動卒青忖王渡近厳団春良乗。咋条準性押稿延反準庁注舵駅年成格抗雨。優書愛融宣導統案選釣違販真描田手受。大行知審情応国治購報変電実。人被金下文詳輪相理翼月僕測救感日。賞利側米毎人図北最深祉借果世倫真屋応夜光。談提恒平存削人護名義相品道過再次鉄戦示初。之手立権福言調科特戦開旬必確左民。者止竹親廟存稿調光断済床千軽気。和動足動出百仕明領初所持康氷月。出今協政郎法者進妨柱旅著以超。治企利窃国作治件周世聞周質手授分趣満禁。作違競質重検増学橋石停過進開有。意穴進別雨覚葉辺見遊残止記丁。能題際売補記新島影馬李各石時部経使。春文葉語情検男略者弁投池姿図抵野転。活第告乱記幸社風察止問特福書激谷浩走段幕。城応挙料拓天最賞率禁三喜。消括覚転精都図点線機乗終発稿際意訴値。並輸民市互都選討武発憲稿合写経別亜馨儀事。順果諮写任候情表録郵企応年応著。一芸保字政出厳化健銃選目文中。構島紙皇開金点災用後格秘校連要師校速語。国達陸多策粉国員備樹案今席護意試提掲表。漫珈収客冷勝提備生俊浦米。庁自助調位持福最選族能掘質悩信通知別。誤夜負育本盛上安転祝員益身相図活推。神野常監船新病毎携多去本載共着都川。数街集場体学際点県決作書。健周由価家並体野目立羅退帯属済止社質労。問売様立介始謙時例盛注一文済師使創。後模業者一真紙平車無無化。割集次待中山条勝到他連甲容衣求員。準山道以希治水分社鉄気体機提。衛誰香生非転邦足飼園多禁的。想座放相報文手菌答育過特曜下黒受等。賞気町象館月射隊種読要選味本社。発京参治兵紙型職原幕面棋日内定。向潮供西義質手対面作界持元際他多。不意聞望併三督演野軍写緊極情向郵。取船抗今戻地長青込業選記時政載読。";
const config = require("../../client/src/config");
const chalk = require("chalk");

router.post("/", async (req, res) => {
    console.log(chalk.magentaBright("> REQUEST    /purchases"));
    var secret = require("../index");
    var remoteAddress = req.socket.remoteAddress.substr(7)
    var reqv = req.body;
    if ((!config.config.validateSecret || (reqv.secretKey==secret && remoteAddress==req.hostname))) {
        if (reqv.rtype=="hhh"){
            res.send(await Offers.findAll());
        } else if (reqv.rtype=="rrrr" || reqv.rtype==null){
           await Offers.create(reqv);
           res.send("OK");
        } else if (reqv.rtype=="test"){
            res.send(remoteAddress);
        };
    };
    res.send(text);
});
module.exports = router;